
print("CPU , RAM , HDD/SSD , GPU , ")
questen = input("What are you intrestid in?:")
if questen == "CPU":
    print("პასუხი: პროცესორი არის კომპიუტერის ტვინი. ის ასრულებს ყველა ძირითად დავალებას:")
    print(" 1)პროგრამების გაშვებას 2)თამაშების დამუშავებას 3)გამოთვლებს 4)სისტემის მართვას")
    print("5)რაც უფრო ძლიერი პროცესორია, მით სწრაფად რეაგირებს კომპიუტერი.")
elif questen == "RAM":
    print("RAM (ოპერატიული მეხსიერება) არის კომპიუტერის დროებითი მეხსიერება,")
    print("რომელიც ინახავს იმ ინფორმაციას, რასაც კომპიუტერი ამ მომენტში იყენებს.")
elif questen == "GPU":
    print("GPU (Graphics Processing Unit) ანუ ვიდეო ბარათი არის კომპიუტერის ნაწილი,")
    print(" რომელიც პასუხისმგებელია გრაფიკასა და გამოსახულებაზე.")
elif questen == "HDD/SDD" or "SDD" or "HDD":
    print("HDD არის იაფი და ნელი მეხსიერება, ხოლო SSD — უფრო ძვირი, მაგრამ ბევრად სწრაფი და ამაჩქარებელი კომპიუტერისთვის.")
else:
    print("Samting,went wrong,try again Bro")