# input _ ბრძანება რომელიც გვაძლევს საშუალებას დაწერილ კოდს ვესაუბროედ ეკრანიდან ისე რომ არ მოგვიწიოს რაიმე კოდის შეცვლა ან დამატება
# input _ შეგვიძშლია გამოვიყენოთ სასაუბროდ,მონაცემების ჩასაწერად,გამოსათვლელად ანდა როგოც უკვე ვთქვი
# მისი მოქმედება
#_____________________
#მაგალითად:
name = input("Enter your name: ")
print(name)
# დასაწყისში როცა ყველაფერი ეკრანზე გამოვა შენ დაინახავ კითხვას(Enter your name: )\
# აქ ჩაწერ სახელს ან თუგინდა ნებისმიერ რამე შემდე print და ცვლადი name დახმარებით შეძლებ ამსი გამოტანას
# და თუ გინდა რომ წინ რაიმე სიტყვა მოაყოლო მაშინ იყენებ (f"") და ბრჭყალებში რაც გინდა და როცა საქმე ცვლადის 
# შემოტანამდე მივა მაშინ გამოიყენე {name}. მაგალითად:
print(f"Hellow {name}, how you doing")