# დავალება:
# დაწერე ფუნქცია, რომელიც მიიღებს ერთ რიცხვს და დააბრუნებს მის კუბს (რიცხვი * რიცხვი * რიცხვი).
# ფუნქციაში არ დაბეჭდო შედეგი, მხოლოდ დააბრუნე return-ით.
# დაბეჭდვა გააკეთე ფუნქციის გამოძახების დროს.

# def კვადრატი():
#     num = int(input("შეიყვანე რიცხვი რომ მიიღო მისი კუბი ~ "))
#     for i in range(3):
#         num *= num * num
#         print(num)       
# კვადრატი()
    
# or~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

def cube(num):
    return num * num * num

number = int(input("შეიყვანე რიცხვი: "))
print(cube(number))
    
