#print გამოაქვს ტერმინალში ინფორმაცია რომელიც მოქცეული იქნება ()_ში

#პითონში არის მონაცემთა ტიპები: String , interger , float.(ჯერ ჯერობით ესენი განვიხილოთ)

#String - ეწპდება ბრჭყალებში მოქცეულ მონაცემს(მაგ. 'GOA' 'Group 97 are best') წერისას მწერთ როგორც(str)
#Integer -ეწოდება მთელ რიცხვებს(მაგ. 10, 27, 51, 1121 ...) იწერება როგროც (int)
#float - ეწოდება წილად რიცხვებს(მაგ. 2.7, 53.2,  255.2 ...)იწრება როგეროც (float)

#მაგალითები print()_ით.

#String-(str)

#print("We are best")
#print("We are CHAD")
#print("We are developers")
 
 #გამოიტანს ტერმინალში ყველა ჩანაწერს რასაც ჩავწერთ ბრჭყალებში( "" ).

#Integer-(int)

#print(1989)
#print(1121)
#print(0)

#გამოიტანს გამოიტანს ციფრებს არ საჭიროებს ( "" ) თუ მისი როგორც წინადადების სახით არ ვწერთ.

#float-(float)

#გამოიტანს წილად რიცხვებს საჭიროებს მხოლოდ ( . ).


#Math-მატემატიკა

#მათემატიკის ელემენტარულის გამოყენება შესაძლებელი თუ თითოეულ ვლადს მივანიჭებთ
#ციფრს Integer(int) ტიპს.
#მაგ:
#x = 5
#y = 10

#print(x + y) აქ ვიყენებთ მათემატიკურ ელემენტებს(+,-,/.* და //)
#print(x - y) +_მიმატება -_გამოკლება *_გამრავლება /_გაყოფა (//_გაყოფა დამრგვალებულად)

#print(5 + 10) არ არის აუცილებელი სხვადასხვა ცლადების შემოტანა შეგიძლიათ
#print(10 - 5) უბრალდო შეგიძლიათ პირდაპირ დაწეროთ.

